<?php

return[
    /** START OF Saved User data **/

    'name' => 'الاسم الكامل',
    'username' => 'اسم المستخدم',
    'email' => 'عنوان البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'image' => 'الصورة الشخصية',
    'phone' => 'رقم الهاتف',
    'role' => 'دور المستخدم',
    'status' => 'حالة الحساب',
    /** END OF Saved User data **/
    /********************************************************************/

    /** START OF Validation messages **/

    'name_regex' => 'يجب أن يحتوي الاسم على أحرف ومسافات فقط.',
    'username_unique' => 'اسم المستخدم هذا مأخوذ بالفعل.',
    'email_unique' => 'البريد الإلكتروني مستخدم بالفعل.',
    'phone_unique' => 'رقم الهاتف مسجل بالفعل.',
    'password_min' => 'يجب أن تكون كلمة المرور على الأقل :min حروف.',
    'phone_regex' => 'يجب أن يبدأ رقم الهاتف بـ 01 ويليه 9 أرقام.',


    'email_password_incorrect' => 'البريد الإلكتروني أو كلمة المرور غير صحيحة',
    'address_en.regex' => 'يجب أن يحتوي العنوان باللغة الإنجليزية على حروف إنجليزية، أرقام، مسافات وفواصل فقط.',
    'address_ar.regex' => 'يجب أن يحتوي العنوان باللغة العربية على أحرف عربية وأرقام فقط.',
    'login_success' => 'لقد قمت بتسجيل الدخول بنجاح',
    'login_error' => 'البريد الإلكتروني أو كلمة المرور غير صحيحة',
    'address_success' => 'تم إضافة العنوان بنجاح',
    'address_default_success' => 'تم تحديد العنوان الافتراضي بنجاح.',
    'unauthorized' => 'غير مصرح',
    'added_to_cart' => 'تمت الإضافة إلى السلة',

    'category_exists_error' => 'الفئة بهذا الاسم موجودة بالفعل.',
    'category_added_success' => 'تمت إضافة الفئة بنجاح!',
    'category_updated_success' => 'تم تحديث الفئة بنجاح!',
    'order_placed_success' => 'تم تقديم الطلب بنجاح!',

    'product_save_error' => 'تعذر حفظ المنتج.',
    'product_update_success' => 'تم تحديث المنتج بنجاح.',
    'product_update_error' => 'تعذر تحديث المنتج.',
    'product_add_success' => 'تم إضافة المنتج بنجاح!',
    'user_update_success' => 'تم تحديث المستخدم بنجاح',
    'user_create_success' => 'تم إنشاء المستخدم بنجاح',
    'add_to_wishlist_success' => 'تمت الإضافة إلى قائمة الأمنيات.',

    'deleted_successfully'=>'تمت عملية الحذف بنجاح',

    'icon_required' => 'حقل الرمز مطلوب.',
    'user_updated_success' => 'تم تحديث المستخدم بنجاح!',
    'user_update_failed' => 'فشل في تحديث المستخدم.',
    'unauthorized_action' => 'أنت غير مصرح لك بتنفيذ هذا الإجراء.',
    'wishlist_fetched_successfully' => 'تم جلب قائمة الرغبات بنجاح.',
    'address_fetched_successfully' => 'تم جلب العناوين بنجاح.',
    'address_en_required_without' => 'العنوان بالإنجليزية مطلوب إذا لم يتم اختيار عنوان.',
    'address_ar_required_without' => 'العنوان بالعربية مطلوب إذا لم يتم اختيار عنوان.',

    'cart_items' => 'عناصر السلة',
    'cart_items.*.quantity' => 'كمية العنصر',
    'cart_items.*.price' => 'سعر العنصر',
    'logout_success' => 'تم تسجيل الخروج بنجاح.',
    /********************************************************************/

    /*Success Messages*/
    'user_created_successfully' => 'تم إنشاء المستخدم بنجاح',

    /**roles**/
    'welcome_seller' => 'مرحبًا مجددًا أيها البائع :name!!',
    'welcome_customer' => 'مرحبًا مجددًا عميلنا المفضل :name!!',
    'welcome_admin'=>'مرحبًا مجددًا أيها المدير :name!!',
    /************************************************************************/
    /* admin dashboard */
    'hi' => 'مرحبًا، :name !',
    'overview' => 'هنا يمكنك عرض نظرة عامة على موقعك على هذه الصفحة.',
    'total_admins' => 'إجمالي المسؤولين',
    'total_sellers' => 'إجمالي البائعين',
    'total_users' => 'إجمالي المستخدمين',
    'total_categories' => 'إجمالي الفئات',
    'total_products' => 'إجمالي المنتجات',
    'total_orders' => 'إجمالي الطلبات',
    /************************************************************************/
    /** add category  **/
    'categorize_products' => 'يمكنك تصنيف منتجاتك بسهولة هنا.',
    'add_category' => 'أضف الفئة',
    'category_name' => 'اسم الفئة:',
    'select_icon' => 'اختر رمزًا:',
    'category_description' => 'وصف الفئة:',
    'fill_description' => 'يرجى إدخال الوصف.',
    'add_category_button' => 'أضف الفئة',
    'product_not_found'=>'تعذر التوصل إلى المنتج',

    /************************************************************************/
    /** add product **/
    'add_products' => 'يمكنك بسهولة إضافة منتجاتك هنا.',
    'add_product' => 'أضف المنتج',
    'product_name' => 'اسم المنتج',
    'clear_name_placeholder' => 'استخدم اسماً أكثر وضوحاً',
    'quantity' => 'الكمية',
    'price' => 'السعر',
    'price_placeholder' => 'xx $',
    'sku' => 'SKU',
    'sku_placeholder' => 'xxx-x',
    'category' => 'الفئة',
    'select_category' => 'اختر الفئة',
    'product_description' => 'وصف المنتج',
    'description_placeholder' => 'هذا وصف للمنتج لمساعدة المستخدمين في معرفة المزيد عنه',
    'images' => 'الصور',
    'add_product_button' => 'أضف المنتج',
    /************************************************************************/
    /*add user*/
    'add_users' => 'يمكنك بسهولة إضافة مستخدمين جدد هنا.',
    'add_user' => 'أضف مستخدم',
    'user_name' => 'اسم المستخدم',
    'user_name_placeholder' => 'الاسم الكامل للمستخدم',
    'username_placeholder' => 'أدخل اسم المستخدم',
    'email_address' => 'عنوان البريد الإلكتروني',
    'email_placeholder' => 'you@example.com',
    'phone_number' => 'رقم الهاتف',
    'phone_placeholder' => 'رقم هاتفك',
    'password_placeholder' => 'أدخل 6 أحرف أو أكثر',
    'user_roles' => 'أدوار المستخدم',
    'select_roles' => 'اختر الأدوار',
    'user_status' => 'حالة الملف الشخصي للمستخدم',
    'select_status' => 'اختر الحالة',
    'add_user_button' => 'أضف مستخدم',
    /************************************************************************/
    /*category table*/
    'hash' => 'رقم',
    'description' => 'الوصف',
    'icon' => 'الأيقونة',
    'created_at' => 'تاريخ الإنشاء',
    'actions' => 'الإجراءات',
    /************************************************************************/
    'added_by' => 'أضيف بواسطة',
    'no_image' => 'لا توجد صورة',
    /************************************************************************/
    // Filter Form
    'filter_by_role' => 'تصفية حسب الدور:',
    'all_roles' => 'جميع الأدوار',
    'admin' => 'مسؤول',
    'seller' => 'بائع',
    'customer' => 'عميل',

    'filter_by_status' => 'تصفية حسب الحالة:',
    'all_statuses' => 'جميع الحالات',
    'active' => 'نشط',
    'inactive' => 'غير نشط',
    'apply_filter' => 'تطبيق التصفية',

    // Table Headers
    'id' => 'معرف',

    'profile_image' => 'صورة الملف الشخصي',
    /************************************************************************/
    'change_info' => 'قم بتغيير معلوماتك الشخصية في هذه الصفحة.',
    'update_profile' => 'تحديث الملف الشخصي',
    'personal_image' => 'الصورة الشخصية (اتركه فارغاً إذا كنت لا ترغب في تغييره)',
    'no_profile_image' => 'لا توجد صورة شخصية متاحة. تم تعيين الصورة الافتراضية.',
    'full_name' => 'الاسم الكامل',
    'fill_in_email' => 'يرجى تعبئة البريد الإلكتروني',
    'leave_blank_password' => 'اتركه فارغاً إذا كنت لا ترغب في تغييره',
    'save_changes' => 'حفظ التغييرات',
    /************************************************************************/
    'dookan_admin' => 'مسؤول دكان',
    'hi_user' => 'مرحباً,',
    'english' => 'الإنجليزية',
    'arabic' => 'العربية',

    /************************************************************************/
    'dashboard' => 'لوحة التحكم',
    'design_studio' => 'استوديو التصميم',
    'forms' => 'نماذج',
    'tables' => 'الجداول',
    'show_users' => 'عرض المستخدمين',
    'show_categories' => 'عرض الفئات',
    'show_products' => 'عرض المنتجات',
    'pages' => 'الصفحات',
    'profile' => 'الملف الشخصي',
    'logout' => 'تسجيل الخروج',
    /************************************************************************/
    'categorize_products_here' => 'صنف منتجاتك بسهولة هنا.',
    'edit_category' => 'تعديل الفئة',
    /************************************************************************/
    'edit_product' => 'تعديل المنتج',
    'use_clear_name' => 'استخدم اسمًا أكثر وضوحًا',
    'product_description_placeholder' => 'هذا وصف المنتج لمساعدة المستخدمين على معرفة المزيد عن المنتج',
    'leave_blank_if_no_change' => 'اتركه فارغًا إذا كنت لا تريد تغييره',
    'current_images' => 'الصور الحالية',
    'product_image' => 'صورة المنتج',
    'no_images' => 'لا توجد صور متاحة، يرجى إضافة بعض الصور.',
    /************************************************************************/
    'edit_user_data' => 'قم بتعديل بيانات المستخدم بسهولة هنا.',
    'leave_sections_blank' => 'اترك الأقسام فارغة إذا كنت لا تريد تغييرها.',
    'edit_user' => 'تعديل المستخدم',
    'full_user_name' => 'الاسم الكامل للمستخدم',
    'example_email' => 'you@example.com',
    'phone_number_placeholder' => 'رقم هاتفك',
    'user_profile_status' => 'حالة ملف المستخدم',
    'user_image' => 'صورة المستخدم',
    'default_image' => 'صورة افتراضية',
    /************************************************************************/
    'login_page' => 'صفحة تسجيل الدخول',
    'submit' => 'إرسال',
    /************************************************************************/
    'login' => 'تسجيل الدخول',
    'forgot_password' => 'هل نسيت كلمة المرور؟',
    'no_account' => 'ليس لديك حساب؟',
    'sign_up' => 'اشترك',
    'placeholder_email' => 'you@example.com',
    'placeholder_password' => 'أدخل 6 أحرف أو أكثر',
    'login_illustration_alt' => 'رسم توضيحي لتسجيل الدخول',
    /************************************************************************/
    'register' => 'تسجيل',
    'placeholder_full_name' => 'اسمك الكامل',
    'placeholder_username' => 'اسم المستخدم الخاص بك',
    'placeholder_phone' => 'رقم هاتفك',
    'already_have_account' => 'هل لديك حساب بالفعل؟',
    'login_here' => 'تسجيل الدخول هنا',
    'register_illustration_alt' => 'رسم توضيحي للتسجيل',
    /************************************************************************/
    'placeholder_product_name' => 'استخدم اسمًا أكثر وضوحًا',
    'placeholder_price' => 'xx $',
    'placeholder_sku' => 'xxx-x',
    'placeholder_description' => 'هذا وصف يساعد المستخدمين على فهم المزيد عن هذا المنتج.',
    'leave_blank' => 'اتركه فارغًا إذا كنت لا تريد تغييره',
    'product_image_alt' => 'صورة المنتج',
    'no_images_available' => 'لا توجد صور متاحة، يرجى إضافة بعض الصور.',
    /************************************************************************/
    'add_your_products' => 'أضف منتجاتك بسهولة هنا.',
    /************************************************************************/
    'dookan_seller' => 'بائع دكان',
    'dashboard_overview' => 'هنا يمكنك معرفة نظرة عامة عن موقعك على هذه الصفحة.',

    /************************************************************************/
    'logo_alt' => 'شعار دكان',
    'search_placeholder' => 'ابحث عن المنتجات والإلهام',
    /************************************************************************/
    'vendors' => 'البائعين',
    'categories' => 'الفئات',
    'contact_us' => 'تواصل معنا',
    /************************************************************************/
    'task' => 'المهام',
    'auth' => 'التوثيق',
    'multi_level' => 'مستوى متعدد',
    'two_links' => 'رابطان',
    'link_1' => 'رابط 1',
    'link_2' => 'رابط 2',
    'notification' => 'الإشعارات',
    'setting' => 'الإعدادات',
    /************************************************************************/
    'orders' => 'الطلبات',
    'addresses' => 'العناوين',
    /************************************************************************/
    'no_products' => 'لا توجد منتجات، عد قريبًا!',
    'no_products_image_alt' => 'لا توجد منتجات متاحة',
    'product_hover_image_alt' => 'صورة عند اللمس :name',
    'show_product' => 'عرض :name',
    'add_to_wishlist' => 'أضف :name إلى قائمة الرغبات',
    'login_to_add_wishlist' => 'يرجى تسجيل الدخول لإضافة المنتج إلى قائمة الرغبات',
    'add_to_cart' => 'أضف :name إلى السلة',
    'login_to_add_cart' => 'يرجى تسجيل الدخول لإضافة المنتج إلى السلة',
    /************************************************************************/
    'thumbnail_image_alt' => 'صورة مصغرة :name',
    'in_stock' => 'متوفر في المخزون',
    'out_of_stock' => 'غير متوفر في المخزون',
    'per_unit' => 'لكل وحدة',
    'no_product_available' => 'نعتذر لذلك، عد قريبًا!',
    'no_product_image_alt' => 'لا توجد بيانات المنتج',
    'add_to_cart_btn'=>'أضف إلى السلة',
    /************************************************************************/
    'empty_cart_message' => 'لا توجد منتجات في عربة التسوق الخاصة بك ، أضف منتجات وعد قريباً!',
    'shopping_cart' => 'عربة التسوق',
    'back_to_shop' => 'العودة إلى المتجر',
    'summary' => 'الملخص',
    'items_count' => 'العدد: :count',
    'shipping' => 'الشحن',
    'total_price' => 'إجمالي السعر',
    'checkout' => 'الدفع',
    'choose_address' => 'اختر العنوان',
    'select_saved_address' => 'يرجى اختيار أحد العناوين المحفوظة:',
    'address' => 'العنوان',
    'no_address' => 'ليس لديك أي عناوين. يرجى إضافة واحدة.',
    'address_en' => 'العنوان (بالإنجليزية)',
    'address_ar' => 'العنوان (بالعربية)',
    'close' => 'إغلاق',
    'submit_order' => 'تقديم الطلب',
    /************************************************************************/
    'my_wishlist' => 'قائمة المفضلة',
    'empty_wishlist_message' => 'لا توجد منتجات في قائمة المفضلة الخاصة بك ، أضف المنتجات وعد لاحقاً!',
    'unit_price' => 'سعر الوحدة',
    'stock_status' => 'حالة المخزون',
    'out_of_stock_message' => 'غير متوفر',
    'remove_from_wishlist' => 'إزالة من المفضلة',
    /************************************************************************/
    'hi_user_ar' => 'مرحباً، :name!',
    'add_address_info' => 'أضف معلومات العنوان الخاص بك في هذه الصفحة.',
    'address_english' => 'العنوان (بالإنجليزية)',
    'address_arabic' => 'العنوان (بالعربية)',
    'select_address' => 'اختر العنوان',
    'no_addresses_found' => 'لم يتم العثور على عناوين لهذا المستخدم.',
    /************************************************************************/
    'change_info_ar' => 'قم بتغيير معلوماتك الشخصية على هذه الصفحة.',
    'personal_image_ar' => 'الصورة الشخصية (اتركها فارغة إذا كنت لا ترغب في تغييرها)',
    'no_image_ar' => 'لا توجد صورة شخصية متاحة؛ تم تعيين الصورة الافتراضية.',
    'full_name_ar' => 'الاسم الكامل',
    'username_ar' => 'اسم المستخدم',
    'email_ar' => 'البريد الإلكتروني',
    'phone_ar' => 'الهاتف',
    'password_ar' => 'كلمة المرور',
    'leave_blank_ar' => 'اتركه فارغاً إذا كنت لا ترغب في تغييره',
    'save_changes_ar' => 'حفظ التغييرات',
    /************************************************************************/
    'selected_address' => 'العنوان المحدد',
    'address_en.required_without' => 'يرجى تقديم العنوان باللغة الإنجليزية إذا لم يتم تحديد أي عنوان آخر.',
    'address_ar.required_without' => 'يرجى تقديم العنوان باللغة العربية إذا لم يتم تحديد أي عنوان آخر.',
    'selected_address.exists' => 'العنوان المحدد غير صالح أو غير موجود.',
    /************************************************************************/
    /** all vendors page **/
    'our_vendors' => 'بائعونا',
    'welcome_message' => 'مرحبًا بكم في قائمتنا الشاملة للبائعين الموثوق بهم!',
    /** all Categories page **/
    'our_categories' => 'التصنيفات الخاصة بنا',
    'categories_welcome_message' => 'مرحباً بكم في قائمتنا الشاملة للتصنيفات!',

];
